""" List of exceptions that are easier to handle manually (for now). """

EXCEPTIONS = {
  'кћи': ['кћи', 'кћери', 'кћери', 'кћер', 'кћери', 'кћери', 'кћери', 'кћери', 'кћери', 'кћерима', 'кћери', 'кћери', 'кћерима', 'кћерима'],
  'мати': ['мати', 'матере', 'матери', 'матер', 'мати', 'матером', 'матери', 'матере', 'матера', 'матерама', 'матере', 'матере', 'матерама', 'матерама'],
  'пиле': ['пиле', 'пилета', 'пилету', 'пиле', 'пиле', 'пилетом', 'пилету', 'пилићи', 'пилића', 'пилићима', 'пилиће', 'пилићи', 'пилићима', 'пилићима'],
  'дете': ['дете', 'детета', 'детету', 'дете', 'дете', 'дететом', 'детету', 'деца', 'деце', 'деци', 'децу', 'децо', 'децом', 'деци'],
}

def return_exception(singular):
  """ Returns full inflection list for a given noun, or None."""
  return EXCEPTIONS.get(singular)