""" List of exceptions that are easier to handle manually (for now). """

EXCEPTIONS = {
  # 3rd group (most of them are in group_mfn_a.py file since they are regular).
  'рука': ['рука', 'руке', 'руци', 'руку', 'руко', 'руком', 'руци', 'руке', 'рука', 'рукама', 'руке', 'руке', 'рукама', 'рукама'],
  'нога': ['нога', 'ноге', 'нози', 'ногу', 'ного', 'ногом', 'нози', 'ноге', 'нога', 'ногама', 'ноге', 'ноге', 'ногама', 'ногама'],
  'слуга': ['слуга', 'слуге', 'слуги', 'слугу', 'слуго', 'слугом', 'слуги', 'слуге', 'слуга', 'слугама', 'слуге', 'слуге', 'слугама', 'слугама'],
  'приповетка': ['приповетка', 'приповетке', 'приповетки', 'приповетку', 'приповетко', 'приповетком', 'приповетки', 'приповетке', 'приповедака', 'приповеткама', 'приповетке', 'приповетке', 'приповеткама', 'приповеткама']
  # 4th group
  'кћи': ['кћи', 'кћери', 'кћери', 'кћер', 'кћери', 'кћери', 'кћери', 'кћери', 'кћери', 'кћерима', 'кћери', 'кћери', 'кћерима', 'кћерима'],
  'мати': ['мати', 'матере', 'матери', 'матер', 'мати', 'матером', 'матери', 'матере', 'матера', 'матерама', 'матере', 'матере', 'матерама', 'матерама'],
  'пиле': ['пиле', 'пилета', 'пилету', 'пиле', 'пиле', 'пилетом', 'пилету', 'пилићи', 'пилића', 'пилићима', 'пилиће', 'пилићи', 'пилићима', 'пилићима'],
  'дете': ['дете', 'детета', 'детету', 'дете', 'дете', 'дететом', 'детету', 'деца', 'деце', 'деци', 'децу', 'децо', 'децом', 'деци'],
}

def return_exception(singular):
  """ Returns full inflection list for a given noun, or None."""
  return EXCEPTIONS.get(singular)