import group_f_c as f_c
import unittest


class TestGroupFCInflection(unittest.TestCase):

    def test_group_f_c_1(self):
        self.assertEqual(["ствар", "ствари", "ствари", "ствар", "стварју", "ствари", "ствари",
                          "ствари", "ствари", "стварима", "ствари", "ствари", "стварима", "стварима"],
                         f_c.inflect("ствар"))

    def test_group_f_c_2(self):
        self.assertEqual(["чађ", "чађи", "чађи", "чађ", "чађу", "чађи", "чађи",
                          "чађи", "чађи", "чађима", "чађи", "чађи", "чађима", "чађима"],
                         f_c.inflect("чађ"))

    def test_group_f_c_3(self):
        self.assertEqual(["пећ", "пећи", "пећи", "пећ", "пећу", "пећи", "пећи",
                          "пећи", "пећи", "пећима", "пећи", "пећи", "пећима", "пећима"],
                         f_c.inflect("пећ"))

    def test_group_f_c_4(self):
        self.assertEqual(["љубав", "љубави", "љубави", "љубав", "љубављу", "љубави", "љубави",
                          "љубави", "љубави", "љубавима", "љубави", "љубави", "љубавима", "љубавима"],
                         f_c.inflect("љубав"))


    def test_group_f_c_5(self):
        self.assertEqual(["памет", "памети", "памети", "памет", "памећу", "памети", "памети",
                          "памети", "памети", "паметима", "памети", "памети", "паметима", "паметима"],
                         f_c.inflect("памет"))

    def test_group_f_c_6(self):
        self.assertEqual(["младост", "младости", "младости", "младост", "младошћу", "младости", "младости",
                          "младости", "младости", "младостима", "младости", "младости", "младостима", "младостима"],
                         f_c.inflect("младост"))

if __name__ == '__main__':
    unittest.main()
